
## :x: Apply Failed

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7686107858)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-lambda-layer/runs/run-VTfX5hKsjTpmWCY5

Waiting for the plan to start...

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 1s [id=7bcc5fd12730e607b2381296e9168868a8b71ac7]
data.aws_iam_role.role: Reading...
data.aws_caller_identity.current: Reading...
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-lambda-layer-Register]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan]
aws_api_gateway_rest_api.api: Refreshing state... [id=o1e3qkz6f9]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-lambda-layer-djansang]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-lambda-layer-Link_table]
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-lambda-layer-Users]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-lambda-layer-scan_user_consulcam]
aws_lambda_function.lambda: Refreshing state... [id=mtchoun-mouh-lambda-layer-user_registration_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=rwxfg3]
aws_api_gateway_method.method: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-OPTIONS]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-POST-200]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan-lambda]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-POST]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-o1e3qkz6f9-rwxfg3-OPTIONS-200]
aws_api_gateway_deployment.test: Refreshing state... [id=suutve]
local_file.index_page: Refreshing state... [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      ~ layers                         = [] -> (known after apply)
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-lambda-layer-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

  # null_resource.lambda_layer will be created
  + resource "null_resource" "lambda_layer" {
      + id       = (known after apply)
      + triggers = {
          + "requirements" = "55dc9e4c73f7daa63444edb70fdb602880a2747e"
        }
    }

Plan: 3 to add, 3 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.74096/mo +$0.0

------------------------------------------------------------------------

null_resource.lambda_layer: Creating...
null_resource.lambda_layer: Provisioning with 'local-exec'...
null_resource.lambda_layer (local-exec): Executing: ["/bin/sh" "-c" "        /bin/bash\n        container_name=lambda_docker\n        docker_image=aws_lambda_builder_image\n\n        docker build --tag $container_name .\n\n        docker run -td --name=$container_name $docker_image\n        docker cp ./requirements.txt $container_name:/\n\n        docker exec -i $container_name /bin/bash < ./docker_install.sh\n        docker cp $container_name:/python.zip python.zip\n        docker stop $container_name\n        docker rm $container_name\n\n"]
null_resource.lambda_layer (local-exec): /bin/sh: 5: docker: not found
null_resource.lambda_layer (local-exec): /bin/sh: 7: docker: not found
null_resource.lambda_layer (local-exec): /bin/sh: 8: docker: not found
null_resource.lambda_layer (local-exec): /bin/sh: 10: cannot open ./docker_install.sh: No such file
null_resource.lambda_layer (local-exec): /bin/sh: 10: docker: not found
null_resource.lambda_layer (local-exec): /bin/sh: 11: docker: not found
null_resource.lambda_layer (local-exec): /bin/sh: 12: docker: not found
null_resource.lambda_layer (local-exec): /bin/sh: 13: docker: not found
aws_lambda_layer_version.test_lambda_layer: Creating...
aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-lambda-layer-djansang]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
aws_s3_bucket.images: Modifications complete after 6s [id=mtchoun-mouh-lambda-layer-djansang]
aws_s3_bucket.website: Modifications complete after 7s [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
╷
│ Error: local-exec provisioner error
│ 
│   with null_resource.lambda_layer,
│   on main.tf line 167, in resource "null_resource" "lambda_layer":
│  167:   provisioner "local-exec" {
│ 
│ Error running command '        /bin/bash
│         container_name=lambda_docker
│         docker_image=aws_lambda_builder_image
│ 
│         docker build --tag $container_name .
│ 
│         docker run -td --name=$container_name $docker_image
│         docker cp ./requirements.txt $container_name:/
│ 
│         docker exec -i $container_name /bin/bash < ./docker_install.sh
│         docker cp $container_name:/python.zip python.zip
│         docker stop $container_name
│         docker rm $container_name
│ 
│ ': exit status 127. Output: /bin/sh: 5: docker: not found
│ /bin/sh: 7: docker: not found
│ /bin/sh: 8: docker: not found
│ /bin/sh: 10: cannot open ./docker_install.sh: No such file
│ /bin/sh: 10: docker: not found
│ /bin/sh: 11: docker: not found
│ /bin/sh: 12: docker: not found
│ /bin/sh: 13: docker: not found
│ 
╵
╷
│ Error: Unable to load "python.zip": open python.zip: no such file or directory
│ 
│   with aws_lambda_layer_version.test_lambda_layer,
│   on main.tf line 196, in resource "aws_lambda_layer_version" "test_lambda_layer":
│  196: resource "aws_lambda_layer_version" "test_lambda_layer" {
│ 
╵
Operation failed: failed running terraform apply (exit 1)

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"994a5df531788f2a30856468b10be146ddeac6eb","Vars":{},"WorkflowName":"Deploy cases"} -->